In [1]:
import pandas

Load the file into Pandas

In [2]:
dataframe = pandas.read_csv("bowling_stats.csv")
dataframe.head()

   2018    Syracuse    N.Y.     7    556
0  2017   Las Vegas    Nev.  10.0  286.0
1  2016        Reno    Nev.   8.0   63.0
2  2015     El Paso   Texas   7.0  315.0
3  2014        Reno    Nev.   9.0   24.0
4  2013        Reno    Nev.  10.0  253.0

Because Pandas assumes the first row is a header, we need to specify that there is no header

In [3]:
dataframe = pandas.read_csv("bowling_stats.csv",header=None)
dataframe.head()

      0           1       2     3      4
0  2018    Syracuse    N.Y.   7.0  556.0
1  2017   Las Vegas    Nev.  10.0  286.0
2  2016        Reno    Nev.   8.0   63.0
3  2015     El Paso   Texas   7.0  315.0
4  2014        Reno    Nev.   9.0   24.0

As a check, compare to the CSV content

In [4]:
!head bowling_stats.csv

2018, Syracuse, N.Y., 7,556
2017, Las Vegas, Nev., 10,286
2016, Reno, Nev., 8,063
2015, El Paso, Texas, 7,315
2014, Reno, Nev., 9,024
2013, Reno, Nev., 10,253
2012, Baton Rouge, La., 11,794
2011, Reno, Nev.,   12,837
2010, Reno, Nev., 14,189
2009, Las Vegas, Nev., 17,200

Label the columns to make manipulation easier to understand

In [12]:
dataframe.columns=['year','city','state','count1','count2']
dataframe.head()

   year        city   state  count1  count2
0  2018    Syracuse    N.Y.     7.0   556.0
1  2017   Las Vegas    Nev.    10.0   286.0
2  2016        Reno    Nev.     8.0    63.0
3  2015     El Paso   Texas     7.0   315.0
4  2014        Reno    Nev.     9.0    24.0

In [11]:
dataframe = pandas.read_csv("bowling_stats.csv",
                            header=None,
                            names=['year','city','state','count1','count2'])

dataframe.head()

   year        city   state  count1  count2
0  2018    Syracuse    N.Y.     7.0   556.0
1  2017   Las Vegas    Nev.    10.0   286.0
2  2016        Reno    Nev.     8.0    63.0
3  2015     El Paso   Texas     7.0   315.0
4  2014        Reno    Nev.     9.0    24.0

In [6]:
dataframe = pandas.read_csv("bowling_stats.csv",
                            header=None,
                            names=['year','city','state','count'],
                            sep=',\s',engine='python')

dataframe.head()

   year       city  state   count
0  2018   Syracuse   N.Y.   7,556
1  2017  Las Vegas   Nev.  10,286
2  2016       Reno   Nev.   8,063
3  2015    El Paso  Texas   7,315
4  2014       Reno   Nev.   9,024

What to do: If 5th column is not NaN, <BR>
combine columns 4 and 5: col_4 = col_4 * 1000 + col_5

In [9]:
pandas.read_csv('bowling_stats.csv')

     2018         Syracuse    N.Y.      7    556
0    2017        Las Vegas    Nev.   10.0  286.0
1    2016             Reno    Nev.    8.0   63.0
2    2015          El Paso   Texas    7.0  315.0
3    2014             Reno    Nev.    9.0   24.0
4    2013             Reno    Nev.   10.0  253.0
5    2012      Baton Rouge     La.   11.0  794.0
6    2011             Reno    Nev.   12.0  837.0
7    2010             Reno    Nev.   14.0  189.0
8    2009        Las Vegas    Nev.   17.0  200.0
9    2008      Albuquerque    N.M.   12.0  615.0
10   2007             Reno    Nev.   16.0  235.0
11   2006   Corpus Christi   Texas   12.0  606.0
12   2005      Baton Rouge     La.   13.0  222.0
13   2004             Reno    Nev.   16.0  585.0
14   2003        Knoxville   Tenn.   12.0  203.0
15   2002         Billings   Mont.   10.0  806.0
16   2001             Reno    Nev.   16.0  104.0
17   2000      Albuquerque    N.M.   10.0  688.0
18   1999         Syracuse    N.Y.    9.0  912.0
19   1998             Reno    Nev.   15.0  925.0
20   1997       Huntsville    Ala.    9.0  480.0
21   1996   Salt Lake City    Utah    9.0  764.0
22   1995             Reno    Nev.   17.0  285.0
23   1994           Mobile    Ala.    9.0  285.0
24   1993            Tulsa   Okla.    8.0  518.0
25   1992   Corpus Christi   Texas    8.0  557.0
26   1991           Toledo    Ohio    8.0  359.0
27   1990             Reno    Nev.    9.0  199.0
28   1989          Wichita    Kan.    7.0  717.0
29   1988     Jacksonville    Fla.    7.0  562.0
..    ...              ...     ...    ...    ...
85   1930        Cleveland    Ohio    2.0  443.0
86   1929          Chicago    Ill.    2.0  523.0
87   1928      Kansas City     Mo.    2.0  251.0
88   1927           Peoria    Ill.    1.0  452.0
89   1926           Toledo    Ohio    1.0  876.0
90   1925          Buffalo    N.Y.    2.0  200.0
91   1924          Chicago    Ill.    2.0  132.0
92   1923        Milwaukee    Wis.    1.0  956.0
93   1922           Toledo    Ohio    1.0  126.0
94   1921          Buffalo    N.Y.  940.0    NaN
95   1920           Peoria    Ill.  900.0    NaN
96   1919           Toledo    Ohio  796.0    NaN
97   1918       Cincinnati    Ohio  654.0    NaN
98   1917     Grand Rapids   Mich.  714.0    NaN
99   1916           Toledo    Ohio  756.0    NaN
100  1915           Peoria    Ill.  513.0    NaN
101  1914          Buffalo    N.Y.  450.0    NaN
102  1913           Toledo    Ohio  502.0    NaN
103  1912          Chicago    Ill.  596.0    NaN
104  1911        St. Louis     Mo.  414.0    NaN
105  1910          Detroit   Mich.  401.0    NaN
106  1909       Pittsburgh     Pa.  374.0    NaN
107  1908       Cincinnati    Ohio  362.0    NaN
108  1907        St. Louis     Mo.  224.0    NaN
109  1906       Louisville     Ky.  221.0    NaN
110  1905        Milwaukee    Wis.  217.0    NaN
111  1904        Cleveland    Ohio  112.0    NaN
112  1903     Indianapolis    Ind.   78.0    NaN
113  1902          Buffalo    N.Y.   61.0    NaN
114  1901          Chicago    Ill.   41.0    NaN

[115 rows x 5 columns]

In [ ]:
#dataframe["count"] = frame[["count", "hundreds"]].sum(axis=1)
dataframe['count']*1000 + dataframe['hundreds']

In [ ]:
def move_to_hund(row):
    if pandas.isna(row['hundreds']):
        row['new'] = row['count']*1000 + row['hundreds']
    else:
        row['new']=row['count']
    return row

(this function shows I don't understand what I'm doing wrong.)

In [ ]:
def move_to_hund(row):
    row['new']=5
#    row['count']=0
    return row

Apply the function to each row

In [ ]:
dataframe.apply(move_to_hund)

I don't get why I can't just run the following

In [ ]:
#dataframe[~pandas.isna(dataframe['hundreds'])]['count']*1000
#dataframe[~pandas.isna(dataframe['hundreds'])]['hundreds']

dataframe['count']=dataframe[~pandas.isna(dataframe['hundreds'])]['count']*1000 + dataframe[~pandas.isna(dataframe['hundreds'])]['hundreds']

In [ ]:
dataframe